
/*
2. Задача на фільтрування масиву

Реалізуйте фільтрування імен які починаються з голосної двома способами:

через умовну конструкцію
через вбудований метод масивів

Рішення має працювати незалежно від конкретних значень в масиві імен
 */
const userNames = ['Петро', 'Емма', 'Юстин', 'Ілля', 'Марта', 'Яна', 'Василь', 'Антон', 'Олена'];
let filteredNames;

// тут ваш код...
filteredNames = quserNames.map((name, index) => {
    if (name[0] ==="А"||name[0] ==="О"||name[0] ==="У"||name[0] ==="И"||name[0] ==="І"||name[0] ==="Е"||name[0] ==="Ю") {
        filteredNames.push(name);
    } else {

    }

    }
)
console.log(filteredNames); // ['Емма', 'Юстин', 'Ілля', 'Яна', 'Антон', 'Олена']